zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_ecc_ecdsa.c
                Cy_Crypto_Core_Vu_SetMemValue (base, VR_BARRETT, (uint8_t const*)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->barrett_o), bitsize);

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_r, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_s, bitsize);
                if(CY_CRYPTO_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                Cy_Crypto_Core_Vu_SetMemValue (base, p_r, (uint8_t *)ephKey.pubkey.x, bitsize);

                mallocMask = CY_CRYPTO_VU_REG_BIT(VR_P) | CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                             CY_CRYPTO_VU_REG_BIT(p_r)  | CY_CRYPTO_VU_REG_BIT(p_s);

                if (!Cy_Crypto_Core_Vu_IsRegZero(base, p_r))
                {
                    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_temp, bitsize);
                    if(CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }

                    tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, p_d, datasize * 8u);
                    if(CY_CRYPTO_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }

                    /* check that x1 is smaller than the order of the base point */
                    if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_r, VR_P))
                    {
                        /* x1 >= order, needs reduction */
                        CY_CRYPTO_VU_MOV(base, p_temp, p_r);
                        Cy_Crypto_Core_Vu_WaitForComplete(base);

                        /* z = x % mod */
                        tmpResult = Cy_Crypto_Core_EC_Bar_MulRed(base, p_r, p_temp, bitsize);
                        if(CY_CRYPTO_SUCCESS != tmpResult)
                        {
                            return tmpResult;
                        }

                        /* r = x1 mod n */
                        Cy_Crypto_Core_Vu_GetMemValue (base, sigPtrRemap, p_r, bitsize);

                        if (Cy_Crypto_Core_Vu_IsRegZero(base, p_r))
                        {
                            /* R is zero!!! */
                            tmpResult = CY_CRYPTO_HW_ERROR;
                        }
                    }
                    else
                    {
                        /* carry is clear, i. e. x1 < order, r = x1 */
                        Cy_Crypto_Core_Vu_GetMemValue(base, sigPtrRemap, p_r, bitsize);
                    }

                    if (CY_CRYPTO_SUCCESS == tmpResult)
                    {
                        /* find s = (e + d*r)/k */
                        /* load signing private key */
                        Cy_Crypto_Core_Vu_SetMemValue (base, p_temp, (uint8_t *)keyKRemap, bitsize);

                        /* use Barrett reduction algorithm for operations modulo n (order of the base point) */
                        Cy_Crypto_Core_EC_NistP_SetRedAlg(CY_CRYPTO_NIST_P_BARRETT_RED_ALG);

                        /* d*r mod n */
                        tmpResult = Cy_Crypto_Core_EC_MulMod(base, p_s, p_temp, p_r, bitsize);    /* z = a * b % mod */
                        if(CY_CRYPTO_SUCCESS != tmpResult)
                        {
                            return tmpResult;
                        }
                        /* load message hash, truncate it if needed. */
                        Cy_Crypto_Core_Vu_SetMemValue (base, p_d, (uint8_t *)hashPtrRemap, datasize * 8u);
                        Cy_Crypto_Core_VU_RegInvertEndianness(base, p_d);

                        if ((datasize * 8u) > bitsize)
                        {
                            CY_CRYPTO_VU_SET_REG(base, dividend, (datasize * 8u) - bitsize, 1u);
                            CY_CRYPTO_VU_LSR(base, p_d, p_d, dividend);
                        }

                        /* check that the prepared hash value is smaller than the order of base point */
                        if (!Cy_Crypto_Core_Vu_IsRegLess(base, p_d, VR_P))
                        {
                            CY_CRYPTO_VU_MOV(base, p_temp, p_d);
                            Cy_Crypto_Core_Vu_WaitForComplete(base);

                            /* z = x % mod */
                            tmpResult = Cy_Crypto_Core_EC_Bar_MulRed(base, p_d, p_temp, bitsize);
                            if(CY_CRYPTO_SUCCESS != tmpResult)
                            {
                                return tmpResult;
                            }
                        }

                        /* Use p_r as temporary register */
                        Cy_Crypto_Core_Vu_SetMemValue (base, p_r, messageKeyPtrRemap, bitsize);

                        /* e + d*r mod n */
                        Cy_Crypto_Core_EC_AddMod (base, p_s, p_d, p_s);      /* z = a + b % mod */

                        /* (e + d*r)/k mod n */
                        tmpResult = CY_CRYPTO_VU_ALLOC_MEM (base, dividend, bitsize);
                        if(CY_CRYPTO_SUCCESS != tmpResult)
                        {
                            return tmpResult;
                        }
                        CY_CRYPTO_VU_MOV(base, dividend, p_s);
                        Cy_Crypto_Core_Vu_WaitForComplete(base);

                        /* z = a / b % mod */
                        tmpResult = Cy_Crypto_Core_EC_DivMod(base, p_s, dividend, p_r, bitsize);
                        if(CY_CRYPTO_SUCCESS != tmpResult)
                        {
                            return tmpResult;
                        }

                        CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(dividend));

                        if (!Cy_Crypto_Core_Vu_IsRegZero(base, p_s))
                        {
                            /* S is not zero!!! */
                            Cy_Crypto_Core_Vu_GetMemValue (base, &sigPtrRemap[bytesize], p_s, bitsize);
                        }
                        else
                        {
                            tmpResult = CY_CRYPTO_HW_ERROR;
                        }
                    }

                    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(p_d) | CY_CRYPTO_VU_REG_BIT(p_temp));
                }

                CY_CRYPTO_VU_FREE_MEM(base, mallocMask);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
                CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to int32_t.');
                SCB_InvalidateDCache_by_Addr(sig, (int32_t)(bytesize*2U));
#endif
            }
        }
    }

    return (tmpResult);
}
#endif /* defined(CY_CRYPTO_CFG_ECDSA_SIGN_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_ECC_VerifyHash
****************************************************************************//**
*
* Verify an ECC signature.
*
* For CAT1C & CAT1D devices when D-Cache is enabled parameters sig, hash and key( x&y of pubkey) must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param sig
* The signature to verify, 'R' followed by 'S'.
*
* \param hash
* The hash (message digest) that was signed.
*
* \param hashlen
* The length of the hash (octets).
*
* \param stat
* Result of signature, 1==valid, 0==invalid.
*
* \param key
* The corresponding public ECC key. See \ref cy_stc_crypto_ecc_key.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_ECC_VerifyHash(CRYPTO_Type *base,
                            const uint8_t *sig, const uint8_t *hash, uint32_t hashlen,
                            uint8_t *stat, const cy_stc_crypto_ecc_key *key)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

